artillery/artillary-load-test.yml
config:
  target: http://127.0.0.1
  phases:
    - duration: 60           # Warm up: 1 minuto
      arrivalRate: 1         # Começa com 1 req/s
      rampTo: 10             # Aumenta gradualmente até 10 req/s
      name: 'warm-up'

    - duration: 120          # Sustain load: 2 minutos
      arrivalRate: 20        # Mantém uma taxa estável de 20 req/s
      name: 'sustain-load'

    - duration: 60           # Spike: 1 minuto
      arrivalRate: 50        # Aumenta a taxa para 50 req/s
      name: 'spike-load'

    - duration: 60           # Ramp down: 1 minuto
      arrivalRate: 50        # Inicia com 50 req/s
      rampTo: 0              # Reduz até 0 req/s gradualmente
      name: 'ramp-down'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  http:
    timeout: 30
    headers:
      User-Agent: "Artillery Load Test"
scenarios:
  - name: "Test Activities Endpoint"
    weight: 70
    flow:
      - get:
          url: '/activities?id=66bada13e54403002078ab10&coords=-47.993931,-16.004896'
          expect:
            - statusCode: 200
  - name: "Test Health Check"
    weight: 20
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200
  - name: "Test Categories Endpoint"
    weight: 10
    flow:
      - get:
          url: '/categories'
          expect:
            - statusCode: 200